app/controllers/activities_controller.rb

INSERT INTO "activities" ("total", "title", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["total", "1"], ["title", "Morning Walk"], ["created_at", "2021-01-16 19:58:43.828010"], ["updated_at", "2021-01-16 19:58:43.828010"]]
---
  def create
    @activity = Activity.create!(activity_params)