app/controllers/measurements_controller.rb

  def create
    @activity.measurements.create!(measurement_params)
---
INSERT INTO "measurements" ("duration", "date", "activity_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["duration", "0.0"], ["date", "2021-01-16T19:58:58.082Z"], ["activity_id", 1], ["created_at", "2021-01-16 19:58:58.295509"], ["updated_at", "2021-01-16 19:58:58.295509"]]

  def set_activity
    @activity = Activity.find(params[:activity_id])
---
SELECT "activities".* FROM "activities" WHERE "activities"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def set_activity_measurement
    @measurement = @activity.measurements.find_by!(id: params[:id]) if @activity
---
SELECT "measurements".* FROM "measurements" WHERE "measurements"."activity_id" = ?  [["activity_id", 1]]