app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Nama"], ["email", "muannama25@gmail.com"], ["password", "1234567"], ["created_at", "2021-01-07 17:13:21.585874"], ["updated_at", "2021-01-07 17:13:21.585874"]]
---
  def create
    user = User.create!(user_params)